resources/e2eTestData.json

{
    "payments": {
        "insertPayment": {
            "merchantID": "63c684fe-8a97-11e8-b99f-9f38301a1e03",
            "title": "string",
            "description": "string",
            "amount": 43,
            "initialPaymentAmount": 23,
            "trialPeriod": 23,
            "currency": "EUR",
            "numberOfPayments": 5,
            "frequency": 10,
            "typeID": 1,
            "networkID": 3
        },
        "updatePayment": {
            "id": "63c684fe-8a97-11e8-b99f-9f38301a1e03",
            "title": "string",
            "description": "string",
            "promo": "string",
            "amount": 43,
            "initialPaymentAmount": 23,
            "trialPeriod": 23,
            "currency": "EUR",
            "numberOfPayments": 5,
            "typeID": 1,
            "frequency": 10,
            "networkID": 3
        }
    },
    "contracts": {
        "insertTestContract": {
            "hdWalletIndex": 0,
            "paymentID": "needed to be injected",
            "numberOfPayments": 4,
            "nextPaymentDate": 10,
            "startTimestamp": 100,
            "customerAddress": "243423",
            "merchantAddress": "merchantadddr",
            "pullPaymentAddress": "24234234",
            "userID": "2342934"
        },
        "updateTestContract": {
            "id": "",
            "hdWalletIndex": 0,
            "numberOfPayments": 5,
            "nextPaymentDate": 10,
            "lastPaymentDate": 20,
            "startTimestamp": 100,
            "statusID": 1,
            "userID": "2342934"
        }
    }
}